# Connect Jupyter Notebook with postgresql

> python3 -m pip install ipython-sql

> ~~python3 -m pip install sqlalchemy~~

> python3 -m pip install psycopg2

if your psycopg2 installation failed it's likely that you have to install:
> sudo apt-get install libpq-dev

- then login to your postgresql's shell environment:
> psql

- create a database:
> create database db_live;


- give the postgres user access to that database:
> \c db_live

> ALTER USER "postgres" WITH PASSWORD 'password';  (if password was not yet set)

In [2]:
%load_ext sql

In [3]:
%%sql
postgresql://postgres:password@localhost/db_live

In [4]:
%%sql
create table test(name varchar(100))

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.DuplicateTable) relation "test" already exists

[SQL: create table test(name varchar(100))]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [5]:
%%sql
insert into test values ('Bob Doe')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [6]:
%%sql
select * from test

 * postgresql://postgres:***@localhost/db_live
3 rows affected.

[('Bob Doe',), ('BOB',), ('Bob Doe',)]

# Keys

- Keys are columns in a table.
- their values can be used to uniquely identify a row in a table.
- Keys are always unique
- almost all tables should have a key

In [7]:
%%sql
create table people2 (full_name varchar(150) PRIMARY KEY, 
description TEXT)

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.DuplicateTable) relation "people2" already exists

[SQL: create table people2 (full_name varchar(150) PRIMARY KEY,
description TEXT)]
(Background on this error at: https://sqlalche.me/e/20/f405)

- the table people can't store persons with the same full name
- a primary key which has meaning is also called natural primary key
- when a table does not have unique fields, a surrogate primary key is used
- surrogate primary key are often called id

In [8]:
%%sql
create table city4 (
    name varchar(30),
    region varchar(30),
    country varchar(30),
    PRIMARY KEY(name, region, country)
)

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.DuplicateTable) relation "city4" already exists

[SQL: create table city4 (
    name varchar(30),
    region varchar(30),
    country varchar(30),
    PRIMARY KEY(name, region, country)
)]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [9]:
%%sql
insert into city3 values ('berlin', 
'berlin', 
'germany')

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.UndefinedTable) relation "city3" does not exist
LINE 1: insert into city3 values ('berlin',
                    ^

[SQL: insert into city3 values ('berlin',
'berlin',
'germany')]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [10]:
%%sql
insert into city4 values ('berlin', 
'berlin2', 
'germany')

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "city4_pkey"
DETAIL:  Key (name, region, country)=(berlin, berlin2, germany) already exists.

[SQL: insert into city4 values ('berlin',
'berlin2',
'germany')]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

- Primary keys can be declared on multiple columns at once.
- no two rows can have the same combination of name, region and country

In [11]:
%%sql
select * from city4

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[('berlin', 'berlin2', 'germany')]

## Foreign Key

- foreign key is a column
- a foreign key points to a unique column of another table
- a foreign key don't have to be unique
- usually they refer to the primary key
- those keys form relationships between tables

In [12]:
%%sql
create table friends(id serial PRIMARY KEY, name varchar(100))

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.DuplicateTable) relation "friends" already exists

[SQL: create table friends(id serial PRIMARY KEY, name varchar(100))]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [13]:
%%sql 
create table messages2 (id serial PRIMARY KEY,
                        friend_id int, 
                        text text,
                        FOREIGN KEY (friend_id) REFERENCES friends(id))

 * postgresql://postgres:***@localhost/db_live
Done.

[]

In [14]:
%%sql 
create table messages3 (id serial PRIMARY KEY,
                        friend_id int REFERENCES friends(id), 
                        text text)

 * postgresql://postgres:***@localhost/db_live
Done.

[]

In [15]:
%%sql
INSERT INTO messages2(friend_id, text) values (1, 'BLA')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [16]:
%%sql
SELECT * from friends

 * postgresql://postgres:***@localhost/db_live
10 rows affected.

[(1, 'Cathy Williams', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (2, 'Brian Ortiz', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (3, 'Marc Hansen', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (4, 'Lisa Meyer', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (5, 'Yolanda Hanson', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (6, 'Kenneth Lawrence', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (7, 'Deanna Barber', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (8, 'Dr. Jeffrey Harper', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (9, 'Stacey Hall', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (10, 'Martha Smith', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17))]

In [17]:
%%sql
insert into friends(name) values ('Lisa')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [18]:
%%sql
SELECT * from friends

 * postgresql://postgres:***@localhost/db_live
11 rows affected.

[(1, 'Cathy Williams', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (2, 'Brian Ortiz', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (3, 'Marc Hansen', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (4, 'Lisa Meyer', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (5, 'Yolanda Hanson', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (6, 'Kenneth Lawrence', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (7, 'Deanna Barber', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (8, 'Dr. Jeffrey Harper', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (9, 'Stacey Hall', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (10, 'Martha Smith', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17)),
 (11, 'Lisa', datetime.datetime(2023, 3, 7, 11, 12), datetime.datetime(2023, 3, 7, 11, 12))]

In [19]:
%%sql
INSERT INTO messages2(friend_id, text) values (2, 'BLA')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [20]:
%%sql 
select * from messages2

 * postgresql://postgres:***@localhost/db_live
2 rows affected.

[(1, 1, 'BLA'), (2, 2, 'BLA')]

In [21]:
%%sql
select * from friends, messages2
where friends.id = messages2.friend_id

 * postgresql://postgres:***@localhost/db_live
2 rows affected.

[(1, 'Cathy Williams', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17), 1, 1, 'BLA'),
 (2, 'Brian Ortiz', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17), 2, 2, 'BLA')]

In [22]:
%%sql
insert into messages2(friend_id, text) values (2, 'BLA2')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [23]:
%%sql
select * from friends, messages2
where friends.id = messages2.friend_id
order by text

 * postgresql://postgres:***@localhost/db_live
3 rows affected.

[(1, 'Cathy Williams', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17), 1, 1, 'BLA'),
 (2, 'Brian Ortiz', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17), 2, 2, 'BLA'),
 (2, 'Brian Ortiz', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17), 3, 2, 'BLA2')]

In [24]:
%%sql
select friends.name, messages2.text from friends, messages2
where friends.id = messages2.friend_id

 * postgresql://postgres:***@localhost/db_live
3 rows affected.

[('Cathy Williams', 'BLA'), ('Brian Ortiz', 'BLA'), ('Brian Ortiz', 'BLA2')]

In [25]:
%%sql
insert into friends(name) values ('Bob')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [26]:
%%sql
insert into messages2(friend_id, text) values (3, 'How you are doing?')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [27]:
%%sql
select messages2.text from friends, messages2
where friends.id = messages2.friend_id and friends.name = 'Bob'

 * postgresql://postgres:***@localhost/db_live
0 rows affected.

[]

# Deleting Related Rows

In [28]:
%%sql
delete from friends where name = 'Lisa'

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [29]:
%%sql
drop table messages2

 * postgresql://postgres:***@localhost/db_live
Done.

[]

In [30]:
%%sql 
create table messages2 (id serial PRIMARY KEY,
                        friend_id int REFERENCES friends(id)
                        ON DELETE SET NULL, 
                        text text)

 * postgresql://postgres:***@localhost/db_live
Done.

[]

In [31]:
%%sql
insert into messages2(friend_id, text) values (2, 'BLA2')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [32]:
%%sql
insert into messages2(friend_id, text) values (3, 'Hello from bob')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [33]:
%%sql
select friends.name, messages2.text from friends, messages2
where friends.id = messages2.friend_id

 * postgresql://postgres:***@localhost/db_live
2 rows affected.

[('Brian Ortiz', 'BLA2'), ('Marc Hansen', 'Hello from bob')]

In [34]:
%%sql
delete from friends where name = 'Lisa'

 * postgresql://postgres:***@localhost/db_live
0 rows affected.

[]

In [35]:
%%sql
select * from messages2

 * postgresql://postgres:***@localhost/db_live
2 rows affected.

[(1, 2, 'BLA2'), (2, 3, 'Hello from bob')]

- instead of ON DELETE SET NULL we could also write:
ON DELETE SET CASCADE
- CASCADE will delete the referencing row.

In [36]:
%%sql
select * from messages, friends limit 1;

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[(1, 3, 'Yet add financial pull consumer Mrs American.\nAll television loss data decide. Thing go ask car go international. To key finally chair seek window street act.', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17), 1, 'Cathy Williams', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17))]

In [37]:
%%sql
select * from messages limit 1;

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[(1, 3, 'Yet add financial pull consumer Mrs American.\nAll television loss data decide. Thing go ask car go international. To key finally chair seek window street act.', datetime.datetime(2023, 3, 7, 11, 10, 17), datetime.datetime(2023, 3, 7, 11, 10, 17))]

## Views
- views are named queries
- views are known as base tables
- you basically create a query and assign a name to the query.
- Only SELECT statements are used in Views.
- when a view is executed, the underlying statement is executed.

In [39]:
%%sql
\d

 * postgresql://postgres:***@localhost/db_live
9 rows affected.

[('public', 'city', 'table', 'postgres'),
 ('public', 'city4', 'table', 'postgres'),
 ('public', 'friends', 'table', 'postgres'),
 ('public', 'friends_id_seq', 'sequence', 'postgres'),
 ('public', 'messages', 'table', 'postgres'),
 ('public', 'messages_id_seq', 'sequence', 'postgres'),
 ('public', 'people', 'table', 'postgres'),
 ('public', 'people2', 'table', 'postgres'),
 ('public', 'test', 'table', 'postgres')]

In [40]:
%%sql
select * from friends

 * postgresql://postgres:***@localhost/db_live
10 rows affected.

[(1, 'Cathy Williams', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (2, 'Brian Ortiz', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (3, 'Marc Hansen', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (4, 'Lisa Meyer', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (5, 'Yolanda Hanson', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (6, 'Kenneth Lawrence', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (7, 'Deanna Barber', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (8, 'Dr. Jeffrey Harper', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (9, 'Stacey Hall', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (10, 'Martha Smith', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16))]

In [42]:
%%sql
select count(*) from friends, messages

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[(100,)]

In [43]:
%%sql 
create view my_count as
select count(*) from friends, messages

 * postgresql://postgres:***@localhost/db_live
Done.

[]

In [44]:
%%sql
select * from my_count

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[(100,)]

In [58]:
%%sql
drop view my_friends;
create view  my_friends as 
select friends.id as f_id, friends.name as full_name, 
messages.friends_id, messages.message from friends, messages
where friends.id = messages.friends_id

 * postgresql://postgres:***@localhost/db_live
Done.
Done.

[]

In [59]:
%%sql
select * from my_friends

 * postgresql://postgres:***@localhost/db_live
10 rows affected.

[(3, 'Marc Hansen', 3, 'Yet add financial pull consumer Mrs American.\nAll television loss data decide. Thing go ask car go international. To key finally chair seek window street act.'),
 (3, 'Marc Hansen', 3, 'Hit plan everybody but feel example especially. Play laugh tell.\nPoint impact figure figure culture officer skill side. That service growth ask leave. Center area power treatment example risk me.'),
 (5, 'Yolanda Hanson', 5, 'Whom race energy a. Beautiful firm address commercial.\nScientist capital decade face cultural individual. President my large market trade direction pick.'),
 (5, 'Yolanda Hanson', 5, 'Professional yes say worker. These it least expert world whether personal.'),
 (10, 'Martha Smith', 10, 'Week owner head laugh else. Course about admit order education shake. South behind military type.'),
 (7, 'Deanna Barber', 7, 'Institution ball concern fill season believe. Live it enjoy argue act.'),
 (5, 'Yolanda Hanson', 5, 'Let sea by green. Over pay movement per arrive start bed. Name yet behavior mind capital look.\nBoard example common boy whether theory professor.'),
 (1, 'Cathy Williams', 1, 'Can her score rather. Go pick church mission. Operation PM home camera board.\nConsider local deal message piece mind TV. Medical subject training six.'),
 (3, 'Marc Hansen', 3, 'Laugh positive always study president institution sort. Strategy seem sit art deep fast threat.\nDebate respond defense about million. Chair note truth idea across interesting write special.'),
 (7, 'Deanna Barber', 7, 'Painting friend lay approach politics kind. Series not finally sort.')]

## Rename View

In [60]:
%%sql
alter view my_friends 
rename to full_name_messages

 * postgresql://postgres:***@localhost/db_live
Done.

[]

In [62]:
%%sql
select * from full_name_messages

 * postgresql://postgres:***@localhost/db_live
10 rows affected.

[(3, 'Marc Hansen', 3, 'Yet add financial pull consumer Mrs American.\nAll television loss data decide. Thing go ask car go international. To key finally chair seek window street act.'),
 (3, 'Marc Hansen', 3, 'Hit plan everybody but feel example especially. Play laugh tell.\nPoint impact figure figure culture officer skill side. That service growth ask leave. Center area power treatment example risk me.'),
 (5, 'Yolanda Hanson', 5, 'Whom race energy a. Beautiful firm address commercial.\nScientist capital decade face cultural individual. President my large market trade direction pick.'),
 (5, 'Yolanda Hanson', 5, 'Professional yes say worker. These it least expert world whether personal.'),
 (10, 'Martha Smith', 10, 'Week owner head laugh else. Course about admit order education shake. South behind military type.'),
 (7, 'Deanna Barber', 7, 'Institution ball concern fill season believe. Live it enjoy argue act.'),
 (5, 'Yolanda Hanson', 5, 'Let sea by green. Over pay movement per arrive start bed. Name yet behavior mind capital look.\nBoard example common boy whether theory professor.'),
 (1, 'Cathy Williams', 1, 'Can her score rather. Go pick church mission. Operation PM home camera board.\nConsider local deal message piece mind TV. Medical subject training six.'),
 (3, 'Marc Hansen', 3, 'Laugh positive always study president institution sort. Strategy seem sit art deep fast threat.\nDebate respond defense about million. Chair note truth idea across interesting write special.'),
 (7, 'Deanna Barber', 7, 'Painting friend lay approach politics kind. Series not finally sort.')]

## Replace view

In [89]:
%%sql
create or replace view full_name_messages as 
select friends.id as f_id, friends.name as full_name, 
messages.friends_id, messages.message from friends, messages
where friends.id = messages.friends_id and
friends.name not like 'C%'
order by friends.id;
select * from full_name_messages;

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.SyntaxError) syntax error at or near "replace"
LINE 1: replace view full_name_messages as
        ^

[SQL: replace view full_name_messages as
select friends.id as f_id, friends.name as full_name,
messages.friends_id, messages.message from friends, messages
where friends.id = messages.friends_id and
friends.name not like 'C%%'
order by friends.id;]
(Background on this error at: https://sqlalche.me/e/20/f405)

## Update
- INSERT, UPDATE and DELETE can be used on a view, only if the view is defined with one single table and the columns modified are present in the view:

In [69]:
%%sql
insert into full_name_messages(full_name, message) values ('Bob', 'hello')

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.ObjectNotInPrerequisiteState) cannot insert into view "full_name_messages"
DETAIL:  Views that do not select from a single table or view are not automatically updatable.
HINT:  To enable inserting into the view, provide an INSTEAD OF INSERT trigger or an unconditional ON INSERT DO INSTEAD rule.

[SQL: insert into full_name_messages(full_name, message) values ('Bob', 'hello')]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [75]:
%%sql
drop view my_friends;
create view my_friends as
select * from friends
where name not like '%y%';
--select * from my_friends;
--select * from friends;

 * postgresql://postgres:***@localhost/db_live
Done.
Done.
(psycopg2.ProgrammingError) can't execute an empty query
[SQL: --select * from my_friends;
--select * from friends;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [77]:
%%sql
select * from my_friends;

 * postgresql://postgres:***@localhost/db_live
6 rows affected.

[(2, 'Brian Ortiz', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (3, 'Marc Hansen', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (5, 'Yolanda Hanson', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (6, 'Kenneth Lawrence', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (7, 'Deanna Barber', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (10, 'Martha Smith', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16))]

In [78]:
%%sql 
insert into my_friends(name) values('Bob');
select * from my_friends;

 * postgresql://postgres:***@localhost/db_live
1 rows affected.
7 rows affected.

[(2, 'Brian Ortiz', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (3, 'Marc Hansen', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (5, 'Yolanda Hanson', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (6, 'Kenneth Lawrence', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (7, 'Deanna Barber', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (10, 'Martha Smith', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (11, 'Bob', datetime.datetime(2023, 3, 7, 11, 52, 40), datetime.datetime(2023, 3, 7, 11, 52, 40))]

In [79]:
%%sql
select * from friends;

 * postgresql://postgres:***@localhost/db_live
11 rows affected.

[(1, 'Cathy Williams', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (2, 'Brian Ortiz', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (3, 'Marc Hansen', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (4, 'Lisa Meyer', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (5, 'Yolanda Hanson', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (6, 'Kenneth Lawrence', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (7, 'Deanna Barber', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (8, 'Dr. Jeffrey Harper', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (9, 'Stacey Hall', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (10, 'Martha Smith', datetime.datetime(2023, 3, 7, 11, 12, 16), datetime.datetime(2023, 3, 7, 11, 12, 16)),
 (11, 'Bob', datetime.datetime(2023, 3, 7, 11, 52, 40), datetime.datetime(2023, 3, 7, 11, 52, 40))]

In [81]:
%%sql
insert into my_friends(name) values ('bye')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [82]:
%%sql
drop view my_friends;
create view my_friends as
select * from friends
where name not like '%y%'
with check option;

 * postgresql://postgres:***@localhost/db_live
Done.
Done.

[]

In [83]:
%%sql
insert into my_friends(name) values ('bye')

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.WithCheckOptionViolation) new row violates check option for view "my_friends"
DETAIL:  Failing row contains (13, bye, 2023-03-07 11:57:33, 2023-03-07 11:57:33).

[SQL: insert into my_friends(name) values ('bye')]
(Background on this error at: https://sqlalche.me/e/20/f405)

## Materialized Views

- A materialized view is a view that has been made persistent
- Subsequent calls to the view, will not process the underlying query
- you can refresh the materialized view

In [84]:
%%sql
create materialized view friend_messages as 
select friends.name, messages.message
from friends, messages
where friends.id = messages.friends_id

 * postgresql://postgres:***@localhost/db_live
10 rows affected.

[]

In [85]:
%%sql
select * from friend_messages

 * postgresql://postgres:***@localhost/db_live
10 rows affected.

[('Marc Hansen', 'Yet add financial pull consumer Mrs American.\nAll television loss data decide. Thing go ask car go international. To key finally chair seek window street act.'),
 ('Marc Hansen', 'Hit plan everybody but feel example especially. Play laugh tell.\nPoint impact figure figure culture officer skill side. That service growth ask leave. Center area power treatment example risk me.'),
 ('Yolanda Hanson', 'Whom race energy a. Beautiful firm address commercial.\nScientist capital decade face cultural individual. President my large market trade direction pick.'),
 ('Yolanda Hanson', 'Professional yes say worker. These it least expert world whether personal.'),
 ('Martha Smith', 'Week owner head laugh else. Course about admit order education shake. South behind military type.'),
 ('Deanna Barber', 'Institution ball concern fill season believe. Live it enjoy argue act.'),
 ('Yolanda Hanson', 'Let sea by green. Over pay movement per arrive start bed. Name yet behavior mind capital look.\nBoard example common boy whether theory professor.'),
 ('Cathy Williams', 'Can her score rather. Go pick church mission. Operation PM home camera board.\nConsider local deal message piece mind TV. Medical subject training six.'),
 ('Marc Hansen', 'Laugh positive always study president institution sort. Strategy seem sit art deep fast threat.\nDebate respond defense about million. Chair note truth idea across interesting write special.'),
 ('Deanna Barber', 'Painting friend lay approach politics kind. Series not finally sort.')]

In [86]:
%%sql
delete from friends
where name like '%Marc%';

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [87]:
%%sql
select * from friend_messages

 * postgresql://postgres:***@localhost/db_live
10 rows affected.

[('Marc Hansen', 'Yet add financial pull consumer Mrs American.\nAll television loss data decide. Thing go ask car go international. To key finally chair seek window street act.'),
 ('Marc Hansen', 'Hit plan everybody but feel example especially. Play laugh tell.\nPoint impact figure figure culture officer skill side. That service growth ask leave. Center area power treatment example risk me.'),
 ('Yolanda Hanson', 'Whom race energy a. Beautiful firm address commercial.\nScientist capital decade face cultural individual. President my large market trade direction pick.'),
 ('Yolanda Hanson', 'Professional yes say worker. These it least expert world whether personal.'),
 ('Martha Smith', 'Week owner head laugh else. Course about admit order education shake. South behind military type.'),
 ('Deanna Barber', 'Institution ball concern fill season believe. Live it enjoy argue act.'),
 ('Yolanda Hanson', 'Let sea by green. Over pay movement per arrive start bed. Name yet behavior mind capital look.\nBoard example common boy whether theory professor.'),
 ('Cathy Williams', 'Can her score rather. Go pick church mission. Operation PM home camera board.\nConsider local deal message piece mind TV. Medical subject training six.'),
 ('Marc Hansen', 'Laugh positive always study president institution sort. Strategy seem sit art deep fast threat.\nDebate respond defense about million. Chair note truth idea across interesting write special.'),
 ('Deanna Barber', 'Painting friend lay approach politics kind. Series not finally sort.')]

## Refresh

In [88]:
%%sql
refresh materialized view friend_messages;
select * from friend_messages;

 * postgresql://postgres:***@localhost/db_live
Done.
7 rows affected.

[('Yolanda Hanson', 'Whom race energy a. Beautiful firm address commercial.\nScientist capital decade face cultural individual. President my large market trade direction pick.'),
 ('Yolanda Hanson', 'Professional yes say worker. These it least expert world whether personal.'),
 ('Martha Smith', 'Week owner head laugh else. Course about admit order education shake. South behind military type.'),
 ('Deanna Barber', 'Institution ball concern fill season believe. Live it enjoy argue act.'),
 ('Yolanda Hanson', 'Let sea by green. Over pay movement per arrive start bed. Name yet behavior mind capital look.\nBoard example common boy whether theory professor.'),
 ('Cathy Williams', 'Can her score rather. Go pick church mission. Operation PM home camera board.\nConsider local deal message piece mind TV. Medical subject training six.'),
 ('Deanna Barber', 'Painting friend lay approach politics kind. Series not finally sort.')]